Revit 2027 API
PerformanceAdviser.SetRuleEnabled(PerformanceAdviserRuleId, Boolean) Method
 Retrieves an enabled/disabled status for the given rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRuleEnabled(
	PerformanceAdviserRuleId id,
	bool enabled
)
Public Sub SetRuleEnabled (
	id As PerformanceAdviserRuleId,
	enabled As Boolean
)
public:
void SetRuleEnabled(
	PerformanceAdviserRuleId^ id,
	bool enabled
)
member SetRuleEnabled :
        id : PerformanceAdviserRuleId *
        enabled : bool -> unit
Parameters
id PerformanceAdviserRuleId
 The rule id to set enabled/disabled status for.
enabled Boolean
 True enables the rule, false disables.
Exceptions
Exception | Condition
ArgumentException |  The id does not correspond to any registered rule.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
SetRuleEnabled Overload
Autodesk.Revit.DB Namespace